# [作業目標]

1. 請建立類似提供結果的 DataFrame：

```
#    Apples  Bananas
# 0      30       21

#             Apples  Bananas
# 2017 Sales      35       21
# 2018 Sales      41       34

```

2. 請問如果現在有一個 DataFrame 如下，請問資料在 Python 中可能長怎樣？

```
#      city  visitor weekday
# 0  Austin      139     Sun
# 1  Dallas      237     Sun
# 2  Austin      326     Mon
# 3  Dallas      456     Mon
```

3. 假設你想知道每個 weekday 的平均 visitor 數量，可以怎麼做？

# 作業

### 1. 請建立類似提供結果的 DataFrame：

```
#    Apples  Bananas
# 0      30       21

#             Apples  Bananas
# 2017 Sales      35       21
# 2018 Sales      41       34

```

In [59]:
# 記得先 Import 正確的套件
import pandas as pd

In [60]:
df = pd.DataFrame([[30, 21]], columns=['Apples', 'Bananas'])
df

   Apples  Bananas
0      30       21

In [61]:
df = pd.DataFrame([[35, 21], [41, 34]], columns=['Apples', 'Bananas'], index=['2017 Sales', '2018 Sales'])
df

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

### 2. 請問如果現在有一個 DataFrame 如下，請問資料在 Python 中可能長怎樣？

```
#      city  visitor weekday
# 0  Austin      139     Sun
# 1  Dallas      237     Sun
# 2  Austin      326     Mon
# 3  Dallas      456     Mon
```

In [62]:
df = pd.DataFrame([['Austin', 139, 'Sun'],['Dallas', 237, 'Sun'], ['Austin',  326, 'Mon'],['Dallas', 456, 'Mon'] ], columns=['city', 'visitor', 'weekday'])
df

     city  visitor weekday
0  Austin      139     Sun
1  Dallas      237     Sun
2  Austin      326     Mon
3  Dallas      456     Mon

In [92]:
df = pd.DataFrame({
    'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
    'visitor': [139, 237, 326, 456],
    'weekday': ['Sun', 'Sun', 'Mon', 'Mon']
})
df

     city  visitor weekday
0  Austin      139     Sun
1  Dallas      237     Sun
2  Austin      326     Mon
3  Dallas      456     Mon

### 3. 承上題，假設你想知道每個 weekday 的平均 visitor 數量，可以怎麼做？

In [89]:
print("Sun: ", df[df['weekday'] == 'Sun']['visitor'].mean())
print("Mon: ", df[df['weekday'] == 'Mon']['visitor'].mean())

Sun:  188.0
Mon:  391.0

In [97]:
df2 = df.loc[:, ['visitor', 'weekday']]
df2.groupby('weekday').mean()

         visitor
weekday
Mon        391.0
Sun        188.0

In [96]:
df.loc[:, ['visitor', 'weekday']].groupby('weekday').mean()

         visitor
weekday
Mon        391.0
Sun        188.0